[
  {
    "id": 1,
    "name": "SOUND'S MART",
    "image": "https://i.ibb.co/9YpL3NC/New-Project-5.png",
    "img_one": "https://i.ibb.co/9YpL3NC/New-Project-5.png",
    "img_two": "https://i.ibb.co/ZxRrx86/2.png",
    "img_three": "https://i.ibb.co/RCjBZn6/3.png",
    "category": ["mern", "react", "tailwind", "firebase"],
    "short_des": "MERN Stack project. It is role base permission website",
    "des": "SOUND'S MART is my 12th Assignment Project. My project topics name is Headphone. To make this project, I used React js, Nodejs, Express js, MongoDB, Google Firebase web applications. SOUND'S MART is Full Stack based website with user role based. This site's dashboard worked for 3 types of user role - admin, seller and buyer. React js application is easy to use for it's reusable UI components and secure access. I like it very much because of it's handling simplicity, also my site work properly with super fast speed. Also anyone can route easily form one page to another. Link routed properly.To make this project I faced some challenges to myself and enjoyed it more. Challenges always attracted to Me!",
    "live": "https://sounds-mart.web.app/",
    "git_client": "https://github.com/Jharna203/sounds-mart_client_repo",
    "git_server": "https://github.com/Jharna203/sounds-mart-server_repo",
    "technology": {
      "one": "React.js",
      "two": "Node.js",
      "three": "Express.js",
      "four": "MongoDB",
      "five": "Tailwind Css",
      "six": "Firebase",
      "seven": "JWT",
      "eight": "Stripe",
      "nine": "env"
    },
    "features": [
      "Made admin user, seller user, buyer user",
      "Made dynamic route and set in navbar",
      "Made server site and created json data file",
      "Data inserted in MongoDB and data retrive to client site",
      "Loaded API and display data in dynamic routes",
      "Created context API",
      "Integrated firebase Auth in my client site",
      "Created private route for my review, Add Services pages and logout option",
      "Set jwt token system",
      "Protected API and Secret key with Environment variable",
      "Using React daisy UI,React icon, React Router Dom",
      "UI responsive for any device and more..."
    ]
  },
  {
    "id": 2,
    "name": "RealEstate Genius",
    "image": "https://i.ibb.co/sFSjwSQ/realestate-ai.png",
    "img_one": "https://i.ibb.co/sFSjwSQ/realestate-ai.png",
    "img_two": "https://i.ibb.co/LzBVTwc/3.png",
    "img_three": "https://i.ibb.co/74Y2fcH/2.png",
    "category": ["mern", "react", "tailwind", "firebase"],
    "short_des": "The aim of RealEstateGenius is to revolutionize the property valuation process using the power of open AI. Our project aims to provide an efficient and accurate solution for generating property descriptions, images, and valuations. ",
    "des": "The aim of RealEstateGenius is to revolutionize the property valuation process using the power of open AI. Our project aims to provide an efficient and accurate solution for generating property descriptions, images, and valuations. By leveraging cutting-edge AI technology, we aim to simplify and streamline the property valuation process, saving time and effort for real estate professionals and individuals. With our user-friendly interface and seamless integration of OpenAI, we strive to empower users with valuable property insights, generate visually captivating descriptions, and enable them to make informed decisions in the real estate market.",
    "live": "https://realestategenius.netlify.app/",
    "git_client": "https://github.com/jharnakhatun2/real-estate-ai",
    "technology": {
      "one": "Open AI API",
      "two" : "React.js (Vite)",
      "three": "Tailwind CSS",
      "four": "Express.js",
      "five": "Node.js",
      "six": "MongoDB" 
    },
    "features": [
      "Property description and image generation with open AI",
      "Social media poster generation with open AI",
      "Generated Property & Poster PDF download",
      "Google SignIn SignUp with Firebase",
      "Property Listings",
      "Property Details",
      "Mailchimp Subscriptions",
      "Blog and Articles",
      "FAQ (optional)",
      "Social Media Integration",
      "Mobile Responsiveness",
      "Testimonials",
      "Toast messages"
    ]
  },
  {
    "id": 3,
    "name": "TRAVEL.XONE",
    "image": "https://i.ibb.co/Jc5WRYy/New-Project-6.png",
    "img_one": "https://i.ibb.co/Jc5WRYy/New-Project-6.png",
    "img_two": "https://i.ibb.co/Nx3V1sf/2.png",
    "img_three": "https://i.ibb.co/h2WhDZ5/3.png",
    "category": ["next", "tailwind", "mern"],
    "short_des": "Tour booking Full Stack Team Project which helps people on their trips",
    "des": "It is a Tour booking management team project. My role is front-end web developer. I created restaurant booking everything which helps people on their trips",
    "live": "https://travel-xone-2023.vercel.app/",
    "git_client": "https://github.com/Johirul-islam-6/travel-xone-client",
    "git_server": "https://github.com/RidoyMia/travel-xone-server",
    "technology": {
      "one": "Next.js",
      "two": "Node.js",
      "three": "Express.js",
      "four": "MongoDB",
      "five": "Tailwind Css",
      "six": "Firebase",
      "seven": "JWT",
      "eight": "Stripe",
      "nine": "env"
    },
    "features": [
      "I am implemented user friendly Interface and online booking system",
      "Added tour detailed Informations, Review and Rating system",
      "I created a secure dashboard for admin and users and added payment gateway service"
    ]
  },
  {
    "id": 4,
    "name": "COURSE DEEP",
    "image": "https://i.ibb.co/bLHbYnd/New-Project-7.png",
    "img_one": "https://i.ibb.co/bLHbYnd/New-Project-7.png",
    "img_two": "https://i.ibb.co/kSypzY2/3.png",
    "img_three": "https://i.ibb.co/XZNgCz1/21.png",
    "category": ["react", "bootstrap", "firebase", "mern"],
    "short_des": "Course Deep is a Learning Management System based project.I created some json data files, loaded API data and displayed data in dynamic routes. I Integrated firebase Authentication in my client site & created a private route for the checkout page.",
    "des": "COURSE DEEP is my full stack Project. To make this project, I used only React js application. React js application is easy to use for it's reusable UI components. I like it very much because of it's handling simplicity, also my site work properly with super fast speed.To make this project I faced some brain strooming challenges to myself and enjoyed it joyfully. Challenges always attracted to Me!",
    "live": "https://course-deep.web.app/",
    "git_client": "https://github.com/jharnakhatun2/course_deep_client",
    "git_server": "https://github.com/jharnakhatun2/course_deep_server",
    "technology": {
      "one": "React.js",
      "two": "Node.js",
      "three": "Express.js",
      "four": "MongoDB",
      "five": "Bootstrap",
      "six": "Firebase",
      "seven": "JWT",
      "eight": "Stripe",
      "nine": "npm"
    },
    "features": [
      "Made dynamic route and set in navbar",
      "Made server site and created json data file",
      "Loaded API and display data in dynamic routes",
      "Integrated firebase Auth in my client site",
      "Created private route for checkout page",
      "Added React Bootstrap, React icon, React Toastify, UI responsive for any device and more..."
    ]
  },
  {
    "id": 5,
    "name": "PORTABLE CHARGER",
    "image": "https://i.ibb.co/RHqCKjq/responsive-landing-page.png",
    "img_one": "https://i.ibb.co/NVqfLhm/html-css-landing-page.png",
    "img_two": "https://i.ibb.co/mBBxVXZ/3html.png",
    "img_three": "https://i.ibb.co/qxGk1LT/htmllanding.png",
    "category": ["html-css"],
    "short_des": "The Portable Charger Landing Page is a professionally designed and responsive web page that effectively markets portable charger products to a wide range of users. Its modern design, user-friendly interface, and strategic features make it a valuable tool for driving brand awareness and customer engagement in the competitive market of portable charging solutions. Whether accessed on a desktop computer, tablet, or mobile phone, this landing page ensures a seamless and visually pleasing experience for all users.",
    "des":"The Portable Charger Landing Page is a responsive HTML and CSS web page designed to showcase and promote portable charger products. This sleek and user-friendly web page provides an engaging and informative experience for users across various devices, ensuring a seamless browsing experience whether they are using a desktop computer, tablet, or mobile phone. Responsive Design: The landing page has been meticulously crafted to adapt to different screen sizes and resolutions, guaranteeing an optimal viewing experience for users on desktops, laptops, tablets, and smartphones. Modern and Attractive Layout: The design of the landing page is not only functional but also visually appealing. It incorporates modern design elements, including a clean and intuitive navigation menu, eye-catching images, and a balanced color scheme that complements the product's aesthetics. Product Showcase: The central focus of the landing page is to showcase the portable charger products. High-quality images and detailed product descriptions are provided, allowing users to explore the features, specifications, and benefits of the chargers. Call to Action (CTA): To encourage user interaction, strategically placed CTAs prompt visitors to take action, such as making a purchase, signing up for a newsletter, or contacting customer support. Informational Sections: Beyond the product showcase, the landing page includes informative sections that highlight the advantages of portable chargers, explain how they work, and offer tips on selecting the right charger for specific needs. Social Media Integration: Links to the company's social media profiles enable users to stay connected and updated with the latest news and promotions.Newsletter Signup: A newsletter signup form can be included to collect leads and expand the customer base. Footer: The footer of the page typically contains important links, such as privacy policies, terms of service, and copyright information.",
    "live": "https://portable-charger.vercel.app/",
    "git_client": "https://github.com/jharnakhatun2/portable-charger",
    "technology": {
      "one": "HTML5",
      "two": "CSS",
      "three": "Responsive design"
    },
    "features": [
      "Increase brand visibility and awareness.",
      "Drive traffic to the product pages",
      "Encourage user engagement and interaction",
      "Generate leads and potential customers",
      "Provide an exceptional user experience across all devices"
    ]
  },
  {
    "id": 6,
    "name": "IMAGE SEARCH APP",
    "image": "https://i.ibb.co/4FtkQFD/image-search-app.png",
    "img_one": "https://i.ibb.co/6mnLS1x/New-Project-5.png",
    "img_two": "https://i.ibb.co/4FtkQFD/image-search-app.png",
    "img_three": "https://i.ibb.co/6mnLS1x/New-Project-5.png",
    "category": ["html-css", "javascript"],
    "short_des": "The Image Search App serves as a platform for users to explore and discover a diverse range of images.",
    "des":"The Image Search App is a web application designed to allow users to explore and discover a wide variety of images. Users can initiate searches by entering keywords, and the app fetches relevant images from an external source, such as Unsplash, using their API. The search results are displayed in an organized grid, with each image accompanied by a brief description and a link to the source. The app incorporates responsive design principles, adapting its layout for various screen sizes. Users can easily navigate through the displayed images and load additional results with the 'Show More' button. Overall, the Image Search App provides a user-friendly and visually engaging experience for exploring and discovering images based on user interests.",
    "live": "https://image-search-app-khaki.vercel.app/",
    "git_client": "https://github.com/jharnakhatun2/Image-Search-App",
    "technology": {
      "one": "HTML5",
      "two": "CSS",
      "three": "javaScript"
    },
    "features": [
      "Users can initiate searches by entering specific keywords relevant to their interests",
      "The app utilizes external APIs, such as Unsplash, to fetch and display relevant images based on user queries",
      "Search results are presented in a well-organized grid format for easy visual exploration",
      "The app incorporates responsive design principles, ensuring an optimal user experience across various device screen sizes",
      "The app includes a 'Show More' button that allows users to load additional search results for a more extensive image exploration"
    ]
  },
  {
    "id": 7,
    "name": "CHOICE TOP PLAYERS",
    "image": "https://i.ibb.co/PhFgS46/java-Script-project.png",
    "img_one": "https://i.ibb.co/0n3K0tX/1.png",
    "img_two": "https://i.ibb.co/DbLcwgz/2.png",
    "img_three": "https://i.ibb.co/q7LM0PS/3.png",
    "category": ["html-css", "javascript"],
    "short_des": "Select Top Players is Document Object Model based Website. Here I implemented querySelector, querySelectorAll, getElementById, getElementsByClassName, addEventListener,Event bubble.",
    "des": "CHOICE TOP PLAYERS is my Document Object Model base project. I made a Side Board in this project where had 2 parts with players and Budget calculation. If you click card Select button, player name will be added in Selected - V fields. You can select only 5 players because of I kept limited this amount. Then you input your expenses in budgets different fields. Finally you will get your total expenses if you click Calculate Total Button.",
    "live": "https://choice-your-top-players.netlify.app/",
    "git_client": "https://github.com/Jharna203/best-five-dom_repo",
    "technology": {
      "one": "html5",
      "two" : "CSS",
      "three": "javaScript"
    },
    "features": [
      "Here I used HTML for markup, CSS for style and javascript for manipulation",
      "I made card with image, title, and select button",
      "I integrated HTML with javascript with getElementById. Also sometimes used querySelector and querySelectorAll",
      "Created button with event handler",
      "I use onClick javaScript event for user interacts with Choice Top Players Site"
    ]
  }
]


